ExperimentResults/single-producer-to-sigle-consumer1.txt
1 records sent, 0.1 records/sec (0.00 MB/sec), 168.0 ms avg latency, 168.0 ms max latency.
73123 records sent, 14618.8 records/sec (13.94 MB/sec), 525.5 ms avg latency, 12450.0 ms max latency.
106596 records sent, 20811.4 records/sec (19.85 MB/sec), 1803.2 ms avg latency, 2759.0 ms max latency.
156240 records sent, 31248.0 records/sec (29.80 MB/sec), 2140.9 ms avg latency, 3557.0 ms max latency.
115920 records sent, 23174.7 records/sec (22.10 MB/sec), 2666.0 ms avg latency, 4604.0 ms max latency.
130914 records sent, 26177.6 records/sec (24.96 MB/sec), 2654.7 ms avg latency, 4651.0 ms max latency.
98784 records sent, 19670.3 records/sec (18.76 MB/sec), 2491.8 ms avg latency, 4953.0 ms max latency.
68670 records sent, 13723.0 records/sec (13.09 MB/sec), 4795.3 ms avg latency, 7199.0 ms max latency.
71442 records sent, 14248.5 records/sec (13.59 MB/sec), 3876.6 ms avg latency, 7201.0 ms max latency.
54684 records sent, 10936.8 records/sec (10.43 MB/sec), 5990.8 ms avg latency, 8641.0 ms max latency.
69930 records sent, 13858.5 records/sec (13.22 MB/sec), 4799.6 ms avg latency, 8593.0 ms max latency.
44856 records sent, 8912.4 records/sec (8.50 MB/sec), 6870.0 ms avg latency, 9229.0 ms max latency.
58968 records sent, 11642.3 records/sec (11.10 MB/sec), 5804.6 ms avg latency, 9580.0 ms max latency.
36666 records sent, 5810.8 records/sec (5.54 MB/sec), 6672.5 ms avg latency, 10029.0 ms max latency.
61110 records sent, 12170.9 records/sec (11.61 MB/sec), 8486.0 ms avg latency, 12398.0 ms max latency.
64386 records sent, 12872.1 records/sec (12.28 MB/sec), 5747.4 ms avg latency, 10467.0 ms max latency.
25326 records sent, 5015.0 records/sec (4.78 MB/sec), 5714.0 ms avg latency, 10482.0 ms max latency.
50778 records sent, 10109.1 records/sec (9.64 MB/sec), 8347.8 ms avg latency, 11441.0 ms max latency.
62874 records sent, 12557.2 records/sec (11.98 MB/sec), 6922.9 ms avg latency, 12281.0 ms max latency.
74718 records sent, 14842.7 records/sec (14.16 MB/sec), 4139.4 ms avg latency, 7719.0 ms max latency.
39312 records sent, 7857.7 records/sec (7.49 MB/sec), 6886.5 ms avg latency, 9225.0 ms max latency.
55944 records sent, 11104.4 records/sec (10.59 MB/sec), 6738.5 ms avg latency, 10149.0 ms max latency.
70434 records sent, 14081.2 records/sec (13.43 MB/sec), 5351.5 ms avg latency, 8090.0 ms max latency.
43848 records sent, 8764.3 records/sec (8.36 MB/sec), 5746.6 ms avg latency, 8338.0 ms max latency.
57078 records sent, 11249.1 records/sec (10.73 MB/sec), 6431.0 ms avg latency, 8969.0 ms max latency.
36666 records sent, 7104.4 records/sec (6.78 MB/sec), 6442.0 ms avg latency, 9585.0 ms max latency.
54306 records sent, 10861.2 records/sec (10.36 MB/sec), 7659.6 ms avg latency, 10483.0 ms max latency.
34650 records sent, 6811.5 records/sec (6.50 MB/sec), 7550.4 ms avg latency, 11833.0 ms max latency.
50904 records sent, 9940.2 records/sec (9.48 MB/sec), 7682.8 ms avg latency, 10905.0 ms max latency.
19656 records sent, 3881.5 records/sec (3.70 MB/sec), 7377.6 ms avg latency, 11567.0 ms max latency.
71316 records sent, 14263.2 records/sec (13.60 MB/sec), 8053.4 ms avg latency, 13692.0 ms max latency.
61362 records sent, 12272.4 records/sec (11.70 MB/sec), 5581.4 ms avg latency, 9697.0 ms max latency.
54810 records sent, 10942.3 records/sec (10.44 MB/sec), 5686.8 ms avg latency, 7847.0 ms max latency.
55944 records sent, 11188.8 records/sec (10.67 MB/sec), 6053.0 ms avg latency, 8947.0 ms max latency.
53550 records sent, 10686.5 records/sec (10.19 MB/sec), 5848.6 ms avg latency, 8861.0 ms max latency.
53046 records sent, 10609.2 records/sec (10.12 MB/sec), 5984.7 ms avg latency, 9097.0 ms max latency.
14490 records sent, 2836.2 records/sec (2.70 MB/sec), 6329.2 ms avg latency, 9505.0 ms max latency.
70308 records sent, 14025.1 records/sec (13.38 MB/sec), 8771.0 ms avg latency, 12748.0 ms max latency.
37296 records sent, 7451.7 records/sec (7.11 MB/sec), 5611.8 ms avg latency, 11242.0 ms max latency.
37044 records sent, 7386.6 records/sec (7.04 MB/sec), 8866.9 ms avg latency, 11634.0 ms max latency.
32760 records sent, 6482.0 records/sec (6.18 MB/sec), 8939.1 ms avg latency, 14405.0 ms max latency.
37296 records sent, 7435.4 records/sec (7.09 MB/sec), 9675.4 ms avg latency, 15568.0 ms max latency.
36288 records sent, 7228.7 records/sec (6.89 MB/sec), 8949.2 ms avg latency, 14517.0 ms max latency.
50148 records sent, 9989.6 records/sec (9.53 MB/sec), 8278.8 ms avg latency, 15062.0 ms max latency.
42840 records sent, 8195.9 records/sec (7.82 MB/sec), 7237.9 ms avg latency, 12660.0 ms max latency.
37044 records sent, 7405.8 records/sec (7.06 MB/sec), 7322.4 ms avg latency, 12309.0 ms max latency.
44604 records sent, 8919.0 records/sec (8.51 MB/sec), 8599.3 ms avg latency, 12828.0 ms max latency.
49770 records sent, 9950.0 records/sec (9.49 MB/sec), 7451.1 ms avg latency, 12516.0 ms max latency.
34902 records sent, 6766.6 records/sec (6.45 MB/sec), 7725.7 ms avg latency, 11740.0 ms max latency.
36540 records sent, 7289.0 records/sec (6.95 MB/sec), 8863.5 ms avg latency, 13125.0 ms max latency.
61110 records sent, 12192.7 records/sec (11.63 MB/sec), 7422.9 ms avg latency, 13466.0 ms max latency.
45108 records sent, 9021.6 records/sec (8.60 MB/sec), 6179.0 ms avg latency, 10719.0 ms max latency.
58968 records sent, 11786.5 records/sec (11.24 MB/sec), 6441.5 ms avg latency, 9564.0 ms max latency.
45234 records sent, 9046.8 records/sec (8.63 MB/sec), 6227.8 ms avg latency, 9238.0 ms max latency.
57834 records sent, 11529.9 records/sec (11.00 MB/sec), 6492.3 ms avg latency, 9035.0 ms max latency.
37800 records sent, 7537.4 records/sec (7.19 MB/sec), 6413.2 ms avg latency, 9560.0 ms max latency.
40194 records sent, 8037.2 records/sec (7.66 MB/sec), 8696.7 ms avg latency, 11070.0 ms max latency.
35910 records sent, 7163.4 records/sec (6.83 MB/sec), 8267.4 ms avg latency, 12415.0 ms max latency.
23310 records sent, 4659.2 records/sec (4.44 MB/sec), 9970.0 ms avg latency, 14225.0 ms max latency.
31374 records sent, 6274.8 records/sec (5.98 MB/sec), 11102.0 ms avg latency, 15034.0 ms max latency.
41202 records sent, 8209.2 records/sec (7.83 MB/sec), 10525.3 ms avg latency, 15839.0 ms max latency.
19404 records sent, 3215.8 records/sec (3.07 MB/sec), 9135.9 ms avg latency, 13990.0 ms max latency.
32130 records sent, 6423.4 records/sec (6.13 MB/sec), 12637.2 ms avg latency, 15855.0 ms max latency.
27720 records sent, 5481.5 records/sec (5.23 MB/sec), 12191.7 ms avg latency, 16370.0 ms max latency.
11718 records sent, 2115.5 records/sec (2.02 MB/sec), 13962.4 ms avg latency, 20923.0 ms max latency.
26460 records sent, 5254.2 records/sec (5.01 MB/sec), 16252.5 ms avg latency, 23368.0 ms max latency.
45612 records sent, 9122.4 records/sec (8.70 MB/sec), 12289.4 ms avg latency, 19201.0 ms max latency.
21924 records sent, 4217.8 records/sec (4.02 MB/sec), 9510.9 ms avg latency, 17645.0 ms max latency.
16254 records sent, 2544.9 records/sec (2.43 MB/sec), 11157.6 ms avg latency, 16171.0 ms max latency.
30618 records sent, 6106.5 records/sec (5.82 MB/sec), 14802.5 ms avg latency, 20095.0 ms max latency.
35784 records sent, 6892.1 records/sec (6.57 MB/sec), 13605.8 ms avg latency, 20709.0 ms max latency.
20286 records sent, 4035.4 records/sec (3.85 MB/sec), 12084.9 ms avg latency, 20688.0 ms max latency.
25830 records sent, 5096.7 records/sec (4.86 MB/sec), 13269.7 ms avg latency, 20894.0 ms max latency.
20664 records sent, 4126.2 records/sec (3.94 MB/sec), 14034.5 ms avg latency, 18991.0 ms max latency.
28602 records sent, 5652.6 records/sec (5.39 MB/sec), 14267.6 ms avg latency, 19993.0 ms max latency.
16128 records sent, 3201.9 records/sec (3.05 MB/sec), 13250.1 ms avg latency, 23055.0 ms max latency.
36414 records sent, 7246.6 records/sec (6.91 MB/sec), 13585.1 ms avg latency, 22371.0 ms max latency.
45234 records sent, 9039.6 records/sec (8.62 MB/sec), 10170.8 ms avg latency, 19216.0 ms max latency.
31500 records sent, 4483.3 records/sec (4.28 MB/sec), 8514.3 ms avg latency, 14713.0 ms max latency.
40194 records sent, 8010.0 records/sec (7.64 MB/sec), 12682.1 ms avg latency, 16886.0 ms max latency.
76356 records sent, 15271.2 records/sec (14.56 MB/sec), 6437.1 ms avg latency, 13845.0 ms max latency.
106092 records sent, 21193.0 records/sec (20.21 MB/sec), 3302.4 ms avg latency, 5851.0 ms max latency.
92862 records sent, 18572.4 records/sec (17.71 MB/sec), 3506.5 ms avg latency, 5109.0 ms max latency.
63000 records sent, 12589.9 records/sec (12.01 MB/sec), 3916.7 ms avg latency, 6433.0 ms max latency.
39564 records sent, 7906.5 records/sec (7.54 MB/sec), 6053.2 ms avg latency, 9128.0 ms max latency.
11970 records sent, 2381.1 records/sec (2.27 MB/sec), 8729.4 ms avg latency, 13497.0 ms max latency.
19278 records sent, 3537.9 records/sec (3.37 MB/sec), 14397.3 ms avg latency, 17665.0 ms max latency.
95004 records sent, 18978.0 records/sec (18.10 MB/sec), 8081.4 ms avg latency, 17683.0 ms max latency.
33516 records sent, 6650.0 records/sec (6.34 MB/sec), 5773.3 ms avg latency, 9074.0 ms max latency.
19404 records sent, 3856.1 records/sec (3.68 MB/sec), 9126.3 ms avg latency, 13323.0 ms max latency.
9450 records sent, 1880.2 records/sec (1.79 MB/sec), 13615.6 ms avg latency, 17782.0 ms max latency.
50904 records sent, 10178.8 records/sec (9.71 MB/sec), 14282.5 ms avg latency, 19084.0 ms max latency.
77112 records sent, 15422.4 records/sec (14.71 MB/sec), 5902.9 ms avg latency, 18049.0 ms max latency.
83034 records sent, 16583.6 records/sec (15.82 MB/sec), 4163.9 ms avg latency, 6488.0 ms max latency.
108738 records sent, 21477.0 records/sec (20.48 MB/sec), 3074.6 ms avg latency, 5818.0 ms max latency.
92484 records sent, 18496.8 records/sec (17.64 MB/sec), 3633.9 ms avg latency, 5595.0 ms max latency.
120204 records sent, 24040.8 records/sec (22.93 MB/sec), 3124.8 ms avg latency, 6089.0 ms max latency.
83160 records sent, 6330.2 records/sec (6.04 MB/sec), 2555.6 ms avg latency, 12438.0 ms max latency.
5000000 records sent, 9579.369869 records/sec (9.14 MB/sec), 6437.59 ms avg latency, 23368.00 ms max latency, 5655 ms 50th, 14408 ms 95th, 18239 ms 99th, 21184 ms 99.9th.